Notebook used for testing out functionality.

In [1]:
import os
import pandas as pd


# Schools DataFrame
schoolPath = os.path.join(".", "Resources", "schools_complete.csv")

school_df = pd.read_csv(schoolPath)


# Student DataFrame
studentPath = os.path.join(".", "Resources", "students_complete.csv")

student_df = pd.read_csv(studentPath)

In [3]:
student_df.shape

(39170, 7)

In [4]:
school_df.shape

(15, 5)

In [5]:
school_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [6]:
student_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [17]:
value = student_df[student_df['math_score'] >= 70].shape[0]

print(type(value))

<class 'int'>

In [18]:
studentWithSchool_df = pd.merge(student_df, school_df, how="left", on=["school_name", "school_name"])

studentWithSchool_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [25]:
studentGroupBySchool_df = studentWithSchool_df.groupby('school_name')

#studentGroupBySchool_df.agg('count')

#pd.value_counts(studentGroupBySchool_df['school_name'])

pd.DataFrame(studentGroupBySchool_df["school_name"].value_counts())


#- Merge into single dataframe
#studentWithSchool_df = pd.merge(student_df, school_df, how="left", on=["school_name", "school_name"])

                                             school_name
school_name           school_name
Bailey High School    Bailey High School            4976
Cabrera High School   Cabrera High School           1858
Figueroa High School  Figueroa High School          2949
Ford High School      Ford High School              2739
Griffin High School   Griffin High School           1468
Hernandez High School Hernandez High School         4635
Holden High School    Holden High School             427
Huang High School     Huang High School             2917
Johnson High School   Johnson High School           4761
Pena High School      Pena High School               962
Rodriguez High School Rodriguez High School         3999
Shelton High School   Shelton High School           1761
Thomas High School    Thomas High School            1635
Wilson High School    Wilson High School            2283
Wright High School    Wright High School            1800

In [27]:
print(type(studentGroupBySchool_df))

<class 'pandas.core.groupby.groupby.DataFrameGroupBy'>

In [26]:
for schoolName, groupedSchool_df in studentGroupBySchool_df:
    print(schoolName)
    print(groupedSchool_df.shape[0])

Bailey High School
4976
Cabrera High School
1858
Figueroa High School
2949
Ford High School
2739
Griffin High School
1468
Hernandez High School
4635
Holden High School
427
Huang High School
2917
Johnson High School
4761
Pena High School
962
Rodriguez High School
3999
Shelton High School
1761
Thomas High School
1635
Wilson High School
2283
Wright High School
1800